In [4]:
from IPython import display

In [5]:
try:
    import nbformat
except:
    !pip install nbformat
display.clear_output()

In [9]:
%run ../model/train.ipynb

+ seed: 42
+ exp_dir: h:\My Drive\DNTAI\2025\teaching\sgu25k2_machine_learning_basic\ws\sgu25_titanic\exps
+ exp_name: eda_251028
+ data_dir: h:\My Drive\DNTAI\2025\teaching\sgu25k2_machine_learning_basic\ws\data\titanic
+ verbose: True
+ save_dir: h:\My Drive\DNTAI\2025\teaching\sgu25k2_machine_learning_basic\ws\sgu25_titanic\exps\eda_251028
---------- information ----------
train-col: {'Survived', 'Name', 'Fare', 'Sex', 'PassengerId', 'Cabin', 'Embarked', 'Ticket', 'Pclass', 'SibSp', 'Parch', 'Age'}
test-col: {'Fare', 'Name', 'Sex', 'PassengerId', 'Cabin', 'Embarked', 'Ticket', 'Pclass', 'SibSp', 'Parch', 'Age'}
Union: {'Fare', 'Name', 'Sex', 'PassengerId', 'Cabin', 'Embarked', 'Ticket', 'Pclass', 'SibSp', 'Parch', 'Age'}
Difference: {'Survived'}

     Sex   Age
0      1  22.0
1      0  38.0
2      0  26.0
3      0  35.0
4      1  35.0
..   ...   ...
886    1  27.0
887    0  19.0
888    0  28.0
889    1  26.0
890    1  32.0

[891 rows x 2 columns]

head(10)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

tail(10)
isna

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

sex

(array(['female', 'male'], dtype=object), array([314, 577], dtype=int64))

Age IsNa: 177
Age Median: 28.0
Age Median: 28.0

In [7]:
!jupyter nbconvert  ../model/train.ipynb --to html

[NbConvertApp] Converting notebook ../model/train.ipynb to html
[NbConvertApp] Writing 586045 bytes to ..\model\train.html

'h:\\My Drive\\DNTAI\\2025\\teaching\\sgu25k2_machine_learning_basic\\ws\\sgu25_titanic\\exps\\eda_251028'